In [98]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.impute import SimpleImputer

# Load the data from the CSV files
tblusers = pd.read_csv('tblusers.csv')
tblvehicles = pd.read_csv('tblvehicles.csv')
tblbooking = pd.read_csv('tblbooking.csv')

In [99]:
print("tblbooking columns:", tblbooking.columns)
print("tblvehicles columns:", tblvehicles.columns)
print("tblusers columns:", tblusers.columns)

tblbooking columns: Index(['id', 'userEmail', 'VehicleId', 'FromDate', 'ToDate'], dtype='object')
tblvehicles columns: Index(['id', 'VehiclesTitle', 'PricePerDay'], dtype='object')
tblusers columns: Index(['id', 'FullName', 'EmailId'], dtype='object')

In [100]:
tblvehicles.head()

   id VehiclesTitle  PricePerDay
0   1        Bike_1          140
1   2        Bike_2          154
2   3        Bike_3           64
3   4        Bike_4          148
4   5        Bike_5          168

In [101]:
tblbooking.head()

   id                   userEmail  VehicleId    FromDate      ToDate
0   1  matthewstewart@example.net         39  2021-01-01  2021-01-02
1   2           ediaz@example.net         43  2021-01-02  2021-01-03
2   3          elynch@example.org         64  2021-01-03  2021-01-04
3   4     jacksondana@example.org         34  2021-01-04  2021-01-05
4   5         ngarcia@example.net         51  2021-01-05  2021-01-06

In [102]:
tblusers.head()

   id         FullName                      EmailId
0   1   Leslie Morales         wwallace@example.org
1   2   Angela Hancock  espinozaclinton@example.net
2   3     Brian Joseph         steven89@example.com
3   4     Kiara Guerra        eanderson@example.net
4   5  Eileen Cisneros           gary35@example.net

In [103]:
tblbooking['VehicleId'] = tblbooking['VehicleId'].replace(dict(zip(tblbooking['VehicleId'].unique(), tblvehicles['id'])))

In [104]:
tblbooking['userEmail'] = tblbooking['userEmail'].replace(dict(zip(tblbooking['userEmail'].unique(), tblusers['EmailId'])))

In [105]:
tblvehicles.head()

   id VehiclesTitle  PricePerDay
0   1        Bike_1          140
1   2        Bike_2          154
2   3        Bike_3           64
3   4        Bike_4          148
4   5        Bike_5          168

In [106]:
tblbooking = tblbooking.rename(columns={'userEmail': 'EmailId'})

tblbooking.head()

   id                      EmailId  VehicleId    FromDate      ToDate
0   1         wwallace@example.org          1  2021-01-01  2021-01-02
1   2  espinozaclinton@example.net          2  2021-01-02  2021-01-03
2   3         steven89@example.com          3  2021-01-03  2021-01-04
3   4        eanderson@example.net          4  2021-01-04  2021-01-05
4   5           gary35@example.net          5  2021-01-05  2021-01-06

In [107]:
tblusers.head()

   id         FullName                      EmailId
0   1   Leslie Morales         wwallace@example.org
1   2   Angela Hancock  espinozaclinton@example.net
2   3     Brian Joseph         steven89@example.com
3   4     Kiara Guerra        eanderson@example.net
4   5  Eileen Cisneros           gary35@example.net

In [108]:
tblbooking['id'] = tblbooking['id'].astype(int)

In [109]:
tblbooking = pd.merge(tblbooking, tblvehicles, on='id', how='left', suffixes=('', '_vehicle'))

In [110]:
print("tblbooking columns:", tblbooking.columns)
print("tblvehicles columns:", tblvehicles.columns)
print("tblusers columns:", tblusers.columns)

tblbooking columns: Index(['id', 'EmailId', 'VehicleId', 'FromDate', 'ToDate', 'VehiclesTitle',
       'PricePerDay'],
      dtype='object')
tblvehicles columns: Index(['id', 'VehiclesTitle', 'PricePerDay'], dtype='object')
tblusers columns: Index(['id', 'FullName', 'EmailId'], dtype='object')

In [111]:




tblbooking = pd.merge(tblbooking, tblusers, on='EmailId', how='left')

In [112]:
tblbooking.head()

,id_x,EmailId,VehicleId,FromDate,ToDate,VehiclesTitle,PricePerDay,id_y,FullName
0,1,wwallace@example.org,1,2021-01-01,2021-01-02,Bike_1,140,1,Leslie Morales
1,2,espinozaclinton@example.net,2,2021-01-02,2021-01-03,Bike_2,154,2,Angela Hancock
2,3,steven89@example.com,3,2021-01-03,2021-01-04,Bike_3,64,3,Brian Joseph
3,4,eanderson@example.net,4,2021-01-04,2021-01-05,Bike_4,148,4,Kiara Guerra
4,5,gary35@example.net,5,2021-01-05,2021-01-06,Bike_5,168,5,Eileen Cisneros

In [113]:
# Convert the 'FromDate' and 'ToDate' columns to datetime objects
tblbooking['FromDate'] = pd.to_datetime(tblbooking['FromDate'])
tblbooking['ToDate'] = pd.to_datetime(tblbooking['ToDate'])

In [114]:
tblbooking.columns

Index(['id_x', 'EmailId', 'VehicleId', 'FromDate', 'ToDate', 'VehiclesTitle',
       'PricePerDay', 'id_y', 'FullName'],
      dtype='object')

In [115]:


# Calculate the number of days between 'FromDate' and 'ToDate'
tblbooking['Days'] = (tblbooking['ToDate'] - tblbooking['FromDate']).dt.days

# Calculate the revenue generated by each booking
tblbooking['Revenue'] = tblbooking['Days'] * tblbooking['PricePerDay']

In [116]:
tblbooking.columns

Index(['id_x', 'EmailId', 'VehicleId', 'FromDate', 'ToDate', 'VehiclesTitle',
       'PricePerDay', 'id_y', 'FullName', 'Days', 'Revenue'],
      dtype='object')

In [117]:
# Drop the 'FromDate' and 'ToDate' columns
tblbooking = tblbooking.drop(columns=['FromDate', 'ToDate'])

# Split the data into training and testing sets
X = tblbooking.drop(columns=['id_x', 'Revenue'])
y = tblbooking['Revenue']

# Impute missing values in the 'PricePerDay' column
imputer = SimpleImputer(strategy='mean')
X['PricePerDay'] = imputer.fit_transform(X[['PricePerDay']])

# Standardize the 'PricePerDay' column
scaler = StandardScaler()
X['PricePerDay'] = scaler.fit_transform(X[['PricePerDay']])

In [118]:
# Save the preprocessed data to new CSV files
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
X_train.to_csv('X_train.csv', index=False)
X_test.to_csv('X_test.csv', index=False)
y_train.to_csv('y_train.csv', index=False)
y_test.to_csv('y_test.csv', index=False)